app/Controllers/Register.php

INSERT INTO `users` (`email`, `password`) VALUES ('email@email.com', '$2y$10$dpl7c69Xztyzo6kiPj9TlOR3H7FyqkymkJoVH1VxeP1urRc0gKfpG')
---
    public function index()
    {
        helper(['form']);
        $rules = [
            'email' => 'required|valid_email|is_unique[users.email]',
            'password' => 'required|min_length[6]',
            'confpassword' => 'matches[password]'
        ];
        if (!$this->validate($rules)) return $this->fail($this->validator->getErrors());
        $data = [
            'email'     => $this->request->getVar('email'),
            'password'  => password_hash($this->request->getVar('password'), PASSWORD_BCRYPT)
        ];
        $model = new UserModel();
        $registered = $model->save($data);